Revit 2027 API
ParameterTypeId.AnalyticalElementHasAssociation Property
 "Has Association": Used for Analytical Member, Analytical Panel, Structural Columns, Structural Framing, Floors, Walls, Structural Foundation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalElementHasAssociation { get; }
Public Shared ReadOnly Property AnalyticalElementHasAssociation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalElementHasAssociation {
	ForgeTypeId^ get ();
}
static member AnalyticalElementHasAssociation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace